MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB606/mcu.h
extern volatile IFS0BITS IFS0bits __attribute__((__sfr__));

#define IFS1 IFS1
extern volatile uint16_t IFS1 __attribute__((__sfr__));
typedef struct tagIFS1BITS {
  uint16_t SI2C1IF:1;
  uint16_t MI2C1IF:1;
  uint16_t CMIF:1;
  uint16_t IOCIF:1;
  uint16_t INT1IF:1;
  uint16_t :1;
  uint16_t CCP5IF:1;
  uint16_t CCP6IF:1;
  uint16_t DMA2IF:1;
  uint16_t OC3IF:1;
  uint16_t OC4IF:1;
  uint16_t T4IF:1;
  uint16_t T5IF:1;
  uint16_t INT2IF:1;
  uint16_t U2RXIF:1;
  uint16_t U2TXIF:1;
} IFS1BITS;
extern volatile IFS1BITS IFS1bits __attribute__((__sfr__));

#define IFS2 IFS2
extern volatile uint16_t IFS2 __attribute__((__sfr__));
typedef struct tagIFS2BITS {
  uint16_t SPI2IF:1;
  uint16_t SPI2TXIF:1;
  uint16_t :2;
  uint16_t DMA3IF:1;
  uint16_t IC3IF:1;
  uint16_t IC4IF:1;
  uint16_t IC5IF:1;
  uint16_t IC6IF:1;
  uint16_t OC5IF:1;
  uint16_t OC6IF:1;
  uint16_t CCT3IF:1;
  uint16_t CCT4IF:1;
  uint16_t PMPIF:1;
  uint16_t DMA4IF:1;
  uint16_t CCT5IF:1;
} IFS2BITS;
extern volatile IFS2BITS IFS2bits __attribute__((__sfr__));

#define IFS3 IFS3
extern volatile uint16_t IFS3 __attribute__((__sfr__));
typedef struct tagIFS3BITS {
  uint16_t CCT6IF:1;
  uint16_t SI2C2IF:1;
  uint16_t MI2C2IF:1;
  uint16_t CCT7IF:1;
  uint16_t :1;
  uint16_t INT3IF:1;
  uint16_t INT4IF:1;
  uint16_t :3;
  uint16_t SPI1RXIF:1;
  uint16_t SPI2RXIF:1;
  uint16_t SPI3RXIF:1;
  uint16_t DMA5IF:1;
  uint16_t RTCIF:1;
  uint16_t CCP1IF:1;
} IFS3BITS;
extern volatile IFS3BITS IFS3bits __attribute__((__sfr__));

#define IFS4 IFS4
extern volatile uint16_t IFS4 __attribute__((__sfr__));
typedef struct tagIFS4BITS {
  uint16_t CCP2IF:1;
  uint16_t U1ERIF:1;
  uint16_t U2ERIF:1;
  uint16_t CRCIF:1;
  uint16_t DMA6IF:1;
  uint16_t DMA7IF:1;
  uint16_t SI2C3IF:1;
  uint16_t MI2C3IF:1;
  uint16_t LVDIF:1;
  uint16_t CCP7IF:1;
  uint16_t :3;
  uint16_t CTMUIF:1;
} IFS4BITS;
extern volatile IFS4BITS IFS4bits __attribute__((__sfr__));

#define IFS5 IFS5
extern volatile uint16_t IFS5 __attribute__((__sfr__));
typedef struct tagIFS5BITS {
  uint16_t :1;
  uint16_t U3ERIF:1;
  uint16_t U3RXIF:1;
  uint16_t U3TXIF:1;
  uint16_t I2C1BCIF:1;
  uint16_t I2C2BCIF:1;
  uint16_t USB1IF:1;
  uint16_t U4ERIF:1;
  uint16_t U4RXIF:1;
  uint16_t U4TXIF:1;
  uint16_t SPI3IF:1;
  uint16_t SPI3TXIF:1;
  uint16_t :2;
  uint16_t CCP3IF:1;
  uint16_t CCP4IF:1;
} IFS5BITS;
extern volatile IFS5BITS IFS5bits __attribute__((__sfr__));

#define IFS6 IFS6
extern volatile uint16_t IFS6 __attribute__((__sfr__));
typedef struct tagIFS6BITS {
  uint16_t CLC1IF:1;
  uint16_t CLC2IF:1;
  uint16_t CLC3IF:1;
  uint16_t CLC4IF:1;
  uint16_t :1;
  uint16_t CCT1IF:1;
  uint16_t CCT2IF:1;
  uint16_t :3;
  uint16_t FSTIF:1;
  uint16_t :2;
  uint16_t I2C3BCIF:1;
  uint16_t RTCCTSIF:1;
  uint16_t U5RXIF:1;
} IFS6BITS;
extern volatile IFS6BITS IFS6bits __attribute__((__sfr__));

#define IFS7 IFS7
extern volatile uint16_t IFS7 __attribute__((__sfr__));
typedef struct tagIFS7BITS {
  uint16_t U5TXIF:1;
  uint16_t U5ERIF:1;
  uint16_t U6RXIF:1;
  uint16_t U6TXIF:1;
  uint16_t U6ERIF:1;
  uint16_t JTAGIF:1;
} IFS7BITS;
extern volatile IFS7BITS IFS7bits __attribute__((__sfr__));

#define IEC0 IEC0
extern volatile uint16_t IEC0 __attribute__((__sfr__));
typedef struct tagIEC0BITS {
  uint16_t INT0IE:1;
  uint16_t IC1IE:1;
  uint16_t OC1IE:1;
  uint16_t T1IE:1;
  uint16_t DMA0IE:1;
  uint16_t IC2IE:1;
  uint16_t OC2IE:1;
  uint16_t T2IE:1;
  uint16_t T3IE:1;
  uint16_t SPI1IE:1;
  uint16_t SPI1TXIE:1;
  uint16_t U1RXIE:1;
  uint16_t U1TXIE:1;
  uint16_t AD1IE:1;
  uint16_t DMA1IE:1;
  uint16_t NVMIE:1;
} IEC0BITS;
extern volatile IEC0BITS IEC0bits __attribute__((__sfr__));

#define IEC1 IEC1
extern volatile uint16_t IEC1 __attribute__((__sfr__));
typedef struct tagIEC1BITS {
  uint16_t SI2C1IE:1;
  uint16_t MI2C1IE:1;
  uint16_t CMIE:1;
  uint16_t IOCIE:1;
  uint16_t INT1IE:1;
  uint16_t :1;
  uint16_t CCP5IE:1;
  uint16_t CCP6IE:1;
  uint16_t DMA2IE:1;
  uint16_t OC3IE:1;
  uint16_t OC4IE:1;
  uint16_t T4IE:1;
  uint16_t T5IE:1;
  uint16_t INT2IE:1;
  uint16_t U2RXIE:1;
  uint16_t U2TXIE:1;
} IEC1BITS;
extern volatile IEC1BITS IEC1bits __attribute__((__sfr__));

#define IEC2 IEC2
extern volatile uint16_t IEC2 __attribute__((__sfr__));
typedef struct tagIEC2BITS {
  uint16_t SPI2IE:1;
  uint16_t SPI2TXIE:1;
  uint16_t :2;
  uint16_t DMA3IE:1;
  uint16_t IC3IE:1;
  uint16_t IC4IE:1;
  uint16_t IC5IE:1;
  uint16_t IC6IE:1;
  uint16_t OC5IE:1;
  uint16_t OC6IE:1;
  uint16_t CCT3IE:1;
  uint16_t CCT4IE:1;
  uint16_t PMPIE:1;
  uint16_t DMA4IE:1;
  uint16_t CCT5IE:1;
} IEC2BITS;
extern volatile IEC2BITS IEC2bits __attribute__((__sfr__));

#define IEC3 IEC3
extern volatile uint16_t IEC3 __attribute__((__sfr__));
typedef struct tagIEC3BITS {
  uint16_t CCT6IE:1;
  uint16_t SI2C2IE:1;
  uint16_t MI2C2IE:1;
  uint16_t CCT7IE:1;
  uint16_t :1;
  uint16_t INT3IE:1;
  uint16_t INT4IE:1;
  uint16_t :3;
  uint16_t SPI1RXIE:1;
  uint16_t SPI2RXIE:1;
  uint16_t SPI3RXIE:1;
  uint16_t DMA5IE:1;
  uint16_t RTCIE:1;
  uint16_t CCP1IE:1;
} IEC3BITS;
extern volatile IEC3BITS IEC3bits __attribute__((__sfr__));

#define IEC4 IEC4
extern volatile uint16_t IEC4 __attribute__((__sfr__));
typedef struct tagIEC4BITS {
  uint16_t CCP2IE:1;
  uint16_t U1ERIE:1;
  uint16_t U2ERIE:1;
  uint16_t CRCIE:1;
  uint16_t DMA6IE:1;
  uint16_t DMA7IE:1;
  uint16_t SI2C3IE:1;
  uint16_t MI2C3IE:1;
  uint16_t LVDIE:1;
  uint16_t CCP7IE:1;
  uint16_t :3;
  uint16_t CTMUIE:1;
} IEC4BITS;
extern volatile IEC4BITS IEC4bits __attribute__((__sfr__));

#define IEC5 IEC5
extern volatile uint16_t IEC5 __attribute__((__sfr__));
typedef struct tagIEC5BITS {
  uint16_t :1;
  uint16_t U3ERIE:1;
  uint16_t U3RXIE:1;
  uint16_t U3TXIE:1;
  uint16_t I2C1BCIE:1;
  uint16_t I2C2BCIE:1;
  uint16_t USB1IE:1;
  uint16_t U4ERIE:1;
  uint16_t U4RXIE:1;
  uint16_t U4TXIE:1;
  uint16_t SPI3IE:1;
  uint16_t SPI3TXIE:1;
  uint16_t :2;
  uint16_t CCP3IE:1;
  uint16_t CCP4IE:1;
} IEC5BITS;
extern volatile IEC5BITS IEC5bits __attribute__((__sfr__));

