MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB606/mcu.h
/* CNPDB */
#define _IOCPDB0 CNPDBbits.IOCPDB0
#define _IOCPDB1 CNPDBbits.IOCPDB1
#define _IOCPDB2 CNPDBbits.IOCPDB2
#define _IOCPDB3 CNPDBbits.IOCPDB3
#define _IOCPDB4 CNPDBbits.IOCPDB4
#define _IOCPDB5 CNPDBbits.IOCPDB5
#define _IOCPDB6 CNPDBbits.IOCPDB6
#define _IOCPDB7 CNPDBbits.IOCPDB7
#define _IOCPDB8 CNPDBbits.IOCPDB8
#define _IOCPDB9 CNPDBbits.IOCPDB9
#define _IOCPDB10 CNPDBbits.IOCPDB10
#define _IOCPDB11 CNPDBbits.IOCPDB11
#define _IOCPDB12 CNPDBbits.IOCPDB12
#define _IOCPDB13 CNPDBbits.IOCPDB13
#define _IOCPDB14 CNPDBbits.IOCPDB14
#define _IOCPDB15 CNPDBbits.IOCPDB15
#define _CNPDB0 CNPDBbits.CNPDB0
#define _CNPDB1 CNPDBbits.CNPDB1
#define _CNPDB2 CNPDBbits.CNPDB2
#define _CNPDB3 CNPDBbits.CNPDB3
#define _CNPDB4 CNPDBbits.CNPDB4
#define _CNPDB5 CNPDBbits.CNPDB5
#define _CNPDB6 CNPDBbits.CNPDB6
#define _CNPDB7 CNPDBbits.CNPDB7
#define _CNPDB8 CNPDBbits.CNPDB8
#define _CNPDB9 CNPDBbits.CNPDB9
#define _CNPDB10 CNPDBbits.CNPDB10
#define _CNPDB11 CNPDBbits.CNPDB11
#define _CNPDB12 CNPDBbits.CNPDB12
#define _CNPDB13 CNPDBbits.CNPDB13
#define _CNPDB14 CNPDBbits.CNPDB14
#define _CNPDB15 CNPDBbits.CNPDB15

/* TRISC */
#define _TRISC12 TRISCbits.TRISC12
#define _TRISC13 TRISCbits.TRISC13
#define _TRISC14 TRISCbits.TRISC14
#define _TRISC15 TRISCbits.TRISC15

/* PORTC */
#define _RC12 PORTCbits.RC12
#define _RC13 PORTCbits.RC13
#define _RC14 PORTCbits.RC14
#define _RC15 PORTCbits.RC15

/* LATC */
#define _LATC12 LATCbits.LATC12
#define _LATC13 LATCbits.LATC13
#define _LATC14 LATCbits.LATC14
#define _LATC15 LATCbits.LATC15

/* ODCC */
#define _ODCC12 ODCCbits.ODCC12
#define _ODCC13 ODCCbits.ODCC13
#define _ODCC14 ODCCbits.ODCC14
#define _ODCC15 ODCCbits.ODCC15

/* ANSC */
#define _ANSC13 ANSCbits.ANSC13
#define _ANSC14 ANSCbits.ANSC14
#define _ANSELC13 ANSCbits.ANSELC13
#define _ANSELC14 ANSCbits.ANSELC14

/* IOCPC */
/* Bitname _IOCPC12 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC13 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC14 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC15 cannot be defined because it is used by more than one SFR */

/* IOCNC */
#define _IOCNC12 IOCNCbits.IOCNC12
#define _IOCNC13 IOCNCbits.IOCNC13
#define _IOCNC14 IOCNCbits.IOCNC14
#define _IOCNC15 IOCNCbits.IOCNC15

/* IOCFC */
#define _IOCFC12 IOCFCbits.IOCFC12
#define _IOCFC13 IOCFCbits.IOCFC13
#define _IOCFC14 IOCFCbits.IOCFC14
#define _IOCFC15 IOCFCbits.IOCFC15

/* CNPUC */
/* Bitname _IOCPC12 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC13 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC14 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC15 cannot be defined because it is used by more than one SFR */
#define _IOCPUC12 CNPUCbits.IOCPUC12
#define _IOCPUC13 CNPUCbits.IOCPUC13
#define _IOCPUC14 CNPUCbits.IOCPUC14
#define _IOCPUC15 CNPUCbits.IOCPUC15
#define _CNPUC12 CNPUCbits.CNPUC12
#define _CNPUC13 CNPUCbits.CNPUC13
#define _CNPUC14 CNPUCbits.CNPUC14
#define _CNPUC15 CNPUCbits.CNPUC15

/* CNPDC */
#define _IOCPDC12 CNPDCbits.IOCPDC12
#define _IOCPDC13 CNPDCbits.IOCPDC13
#define _IOCPDC14 CNPDCbits.IOCPDC14
#define _IOCPDC15 CNPDCbits.IOCPDC15
#define _CNPDC12 CNPDCbits.CNPDC12
#define _CNPDC13 CNPDCbits.CNPDC13
#define _CNPDC14 CNPDCbits.CNPDC14
#define _CNPDC15 CNPDCbits.CNPDC15

/* TRISD */
#define _TRISD0 TRISDbits.TRISD0
#define _TRISD1 TRISDbits.TRISD1
#define _TRISD2 TRISDbits.TRISD2
#define _TRISD3 TRISDbits.TRISD3
#define _TRISD4 TRISDbits.TRISD4
#define _TRISD5 TRISDbits.TRISD5
#define _TRISD6 TRISDbits.TRISD6
#define _TRISD7 TRISDbits.TRISD7
#define _TRISD8 TRISDbits.TRISD8
#define _TRISD9 TRISDbits.TRISD9
#define _TRISD10 TRISDbits.TRISD10
#define _TRISD11 TRISDbits.TRISD11

/* PORTD */
#define _RD0 PORTDbits.RD0
#define _RD1 PORTDbits.RD1
#define _RD2 PORTDbits.RD2
#define _RD3 PORTDbits.RD3
#define _RD4 PORTDbits.RD4
#define _RD5 PORTDbits.RD5
#define _RD6 PORTDbits.RD6
#define _RD7 PORTDbits.RD7
#define _RD8 PORTDbits.RD8
#define _RD9 PORTDbits.RD9
#define _RD10 PORTDbits.RD10
#define _RD11 PORTDbits.RD11

/* LATD */
#define _LATD0 LATDbits.LATD0
#define _LATD1 LATDbits.LATD1
#define _LATD2 LATDbits.LATD2
#define _LATD3 LATDbits.LATD3
#define _LATD4 LATDbits.LATD4
#define _LATD5 LATDbits.LATD5
#define _LATD6 LATDbits.LATD6
#define _LATD7 LATDbits.LATD7
#define _LATD8 LATDbits.LATD8
#define _LATD9 LATDbits.LATD9
#define _LATD10 LATDbits.LATD10
#define _LATD11 LATDbits.LATD11

/* ODCD */
#define _ODCD0 ODCDbits.ODCD0
#define _ODCD1 ODCDbits.ODCD1
#define _ODCD2 ODCDbits.ODCD2
#define _ODCD3 ODCDbits.ODCD3
#define _ODCD4 ODCDbits.ODCD4
#define _ODCD5 ODCDbits.ODCD5
#define _ODCD6 ODCDbits.ODCD6
#define _ODCD7 ODCDbits.ODCD7
#define _ODCD8 ODCDbits.ODCD8
#define _ODCD9 ODCDbits.ODCD9
#define _ODCD10 ODCDbits.ODCD10
#define _ODCD11 ODCDbits.ODCD11

/* ANSD */
#define _ANSD6 ANSDbits.ANSD6
#define _ANSD7 ANSDbits.ANSD7
#define _ANSELD6 ANSDbits.ANSELD6
#define _ANSELD7 ANSDbits.ANSELD7

/* IOCPD */
/* Bitname _IOCPD0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD9 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD10 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD11 cannot be defined because it is used by more than one SFR */

