MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB606/mcu.h
/* IOCND */
#define _IOCND0 IOCNDbits.IOCND0
#define _IOCND1 IOCNDbits.IOCND1
#define _IOCND2 IOCNDbits.IOCND2
#define _IOCND3 IOCNDbits.IOCND3
#define _IOCND4 IOCNDbits.IOCND4
#define _IOCND5 IOCNDbits.IOCND5
#define _IOCND6 IOCNDbits.IOCND6
#define _IOCND7 IOCNDbits.IOCND7
#define _IOCND8 IOCNDbits.IOCND8
#define _IOCND9 IOCNDbits.IOCND9
#define _IOCND10 IOCNDbits.IOCND10
#define _IOCND11 IOCNDbits.IOCND11

/* IOCFD */
#define _IOCFD0 IOCFDbits.IOCFD0
#define _IOCFD1 IOCFDbits.IOCFD1
#define _IOCFD2 IOCFDbits.IOCFD2
#define _IOCFD3 IOCFDbits.IOCFD3
#define _IOCFD4 IOCFDbits.IOCFD4
#define _IOCFD5 IOCFDbits.IOCFD5
#define _IOCFD6 IOCFDbits.IOCFD6
#define _IOCFD7 IOCFDbits.IOCFD7
#define _IOCFD8 IOCFDbits.IOCFD8
#define _IOCFD9 IOCFDbits.IOCFD9
#define _IOCFD10 IOCFDbits.IOCFD10
#define _IOCFD11 IOCFDbits.IOCFD11

/* CNPUD */
/* Bitname _IOCPD0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD9 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD10 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPD11 cannot be defined because it is used by more than one SFR */
#define _IOCPUD0 CNPUDbits.IOCPUD0
#define _IOCPUD1 CNPUDbits.IOCPUD1
#define _IOCPUD2 CNPUDbits.IOCPUD2
#define _IOCPUD3 CNPUDbits.IOCPUD3
#define _IOCPUD4 CNPUDbits.IOCPUD4
#define _IOCPUD5 CNPUDbits.IOCPUD5
#define _IOCPUD6 CNPUDbits.IOCPUD6
#define _IOCPUD7 CNPUDbits.IOCPUD7
#define _IOCPUD8 CNPUDbits.IOCPUD8
#define _IOCPUD9 CNPUDbits.IOCPUD9
#define _IOCPUD10 CNPUDbits.IOCPUD10
#define _IOCPUD11 CNPUDbits.IOCPUD11
#define _CNPUD0 CNPUDbits.CNPUD0
#define _CNPUD1 CNPUDbits.CNPUD1
#define _CNPUD2 CNPUDbits.CNPUD2
#define _CNPUD3 CNPUDbits.CNPUD3
#define _CNPUD4 CNPUDbits.CNPUD4
#define _CNPUD5 CNPUDbits.CNPUD5
#define _CNPUD6 CNPUDbits.CNPUD6
#define _CNPUD7 CNPUDbits.CNPUD7
#define _CNPUD8 CNPUDbits.CNPUD8
#define _CNPUD9 CNPUDbits.CNPUD9
#define _CNPUD10 CNPUDbits.CNPUD10
#define _CNPUD11 CNPUDbits.CNPUD11

/* CNPDD */
#define _IOCPDD0 CNPDDbits.IOCPDD0
#define _IOCPDD1 CNPDDbits.IOCPDD1
#define _IOCPDD2 CNPDDbits.IOCPDD2
#define _IOCPDD3 CNPDDbits.IOCPDD3
#define _IOCPDD4 CNPDDbits.IOCPDD4
#define _IOCPDD5 CNPDDbits.IOCPDD5
#define _IOCPDD6 CNPDDbits.IOCPDD6
#define _IOCPDD7 CNPDDbits.IOCPDD7
#define _IOCPDD8 CNPDDbits.IOCPDD8
#define _IOCPDD9 CNPDDbits.IOCPDD9
#define _IOCPDD10 CNPDDbits.IOCPDD10
#define _IOCPDD11 CNPDDbits.IOCPDD11
#define _CNPDD0 CNPDDbits.CNPDD0
#define _CNPDD1 CNPDDbits.CNPDD1
#define _CNPDD2 CNPDDbits.CNPDD2
#define _CNPDD3 CNPDDbits.CNPDD3
#define _CNPDD4 CNPDDbits.CNPDD4
#define _CNPDD5 CNPDDbits.CNPDD5
#define _CNPDD6 CNPDDbits.CNPDD6
#define _CNPDD7 CNPDDbits.CNPDD7
#define _CNPDD8 CNPDDbits.CNPDD8
#define _CNPDD9 CNPDDbits.CNPDD9
#define _CNPDD10 CNPDDbits.CNPDD10
#define _CNPDD11 CNPDDbits.CNPDD11

/* TRISE */
#define _TRISE0 TRISEbits.TRISE0
#define _TRISE1 TRISEbits.TRISE1
#define _TRISE2 TRISEbits.TRISE2
#define _TRISE3 TRISEbits.TRISE3
#define _TRISE4 TRISEbits.TRISE4
#define _TRISE5 TRISEbits.TRISE5
#define _TRISE6 TRISEbits.TRISE6
#define _TRISE7 TRISEbits.TRISE7

/* PORTE */
#define _RE0 PORTEbits.RE0
#define _RE1 PORTEbits.RE1
#define _RE2 PORTEbits.RE2
#define _RE3 PORTEbits.RE3
#define _RE4 PORTEbits.RE4
#define _RE5 PORTEbits.RE5
#define _RE6 PORTEbits.RE6
#define _RE7 PORTEbits.RE7

/* LATE */
#define _LATE0 LATEbits.LATE0
#define _LATE1 LATEbits.LATE1
#define _LATE2 LATEbits.LATE2
#define _LATE3 LATEbits.LATE3
#define _LATE4 LATEbits.LATE4
#define _LATE5 LATEbits.LATE5
#define _LATE6 LATEbits.LATE6
#define _LATE7 LATEbits.LATE7

/* ODCE */
#define _ODCE0 ODCEbits.ODCE0
#define _ODCE1 ODCEbits.ODCE1
#define _ODCE2 ODCEbits.ODCE2
#define _ODCE3 ODCEbits.ODCE3
#define _ODCE4 ODCEbits.ODCE4
#define _ODCE5 ODCEbits.ODCE5
#define _ODCE6 ODCEbits.ODCE6
#define _ODCE7 ODCEbits.ODCE7

/* ANSE */
#define _ANSE4 ANSEbits.ANSE4
#define _ANSELE4 ANSEbits.ANSELE4

/* IOCPE */
/* Bitname _IOCPE0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE7 cannot be defined because it is used by more than one SFR */

/* IOCNE */
#define _IOCNE0 IOCNEbits.IOCNE0
#define _IOCNE1 IOCNEbits.IOCNE1
#define _IOCNE2 IOCNEbits.IOCNE2
#define _IOCNE3 IOCNEbits.IOCNE3
#define _IOCNE4 IOCNEbits.IOCNE4
#define _IOCNE5 IOCNEbits.IOCNE5
#define _IOCNE6 IOCNEbits.IOCNE6
#define _IOCNE7 IOCNEbits.IOCNE7

/* IOCFE */
#define _IOCFE0 IOCFEbits.IOCFE0
#define _IOCFE1 IOCFEbits.IOCFE1
#define _IOCFE2 IOCFEbits.IOCFE2
#define _IOCFE3 IOCFEbits.IOCFE3
#define _IOCFE4 IOCFEbits.IOCFE4
#define _IOCFE5 IOCFEbits.IOCFE5
#define _IOCFE6 IOCFEbits.IOCFE6
#define _IOCFE7 IOCFEbits.IOCFE7

/* CNPUE */
/* Bitname _IOCPE0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPE7 cannot be defined because it is used by more than one SFR */
#define _IOCPUE0 CNPUEbits.IOCPUE0
#define _IOCPUE1 CNPUEbits.IOCPUE1
#define _IOCPUE2 CNPUEbits.IOCPUE2
#define _IOCPUE3 CNPUEbits.IOCPUE3
#define _IOCPUE4 CNPUEbits.IOCPUE4
#define _IOCPUE5 CNPUEbits.IOCPUE5
#define _IOCPUE6 CNPUEbits.IOCPUE6
#define _IOCPUE7 CNPUEbits.IOCPUE7
#define _CNPUE0 CNPUEbits.CNPUE0
#define _CNPUE1 CNPUEbits.CNPUE1
#define _CNPUE2 CNPUEbits.CNPUE2
#define _CNPUE3 CNPUEbits.CNPUE3
#define _CNPUE4 CNPUEbits.CNPUE4
#define _CNPUE5 CNPUEbits.CNPUE5
#define _CNPUE6 CNPUEbits.CNPUE6
#define _CNPUE7 CNPUEbits.CNPUE7

/* CNPDE */
#define _IOCPDE0 CNPDEbits.IOCPDE0
#define _IOCPDE1 CNPDEbits.IOCPDE1
#define _IOCPDE2 CNPDEbits.IOCPDE2
#define _IOCPDE3 CNPDEbits.IOCPDE3
#define _IOCPDE4 CNPDEbits.IOCPDE4
#define _IOCPDE5 CNPDEbits.IOCPDE5
#define _IOCPDE6 CNPDEbits.IOCPDE6
#define _IOCPDE7 CNPDEbits.IOCPDE7
#define _CNPDE0 CNPDEbits.CNPDE0
#define _CNPDE1 CNPDEbits.CNPDE1
#define _CNPDE2 CNPDEbits.CNPDE2
#define _CNPDE3 CNPDEbits.CNPDE3
#define _CNPDE4 CNPDEbits.CNPDE4
#define _CNPDE5 CNPDEbits.CNPDE5
#define _CNPDE6 CNPDEbits.CNPDE6
#define _CNPDE7 CNPDEbits.CNPDE7

/* TRISF */
#define _TRISF0 TRISFbits.TRISF0
#define _TRISF1 TRISFbits.TRISF1
#define _TRISF3 TRISFbits.TRISF3
#define _TRISF4 TRISFbits.TRISF4
#define _TRISF5 TRISFbits.TRISF5
#define _TRISF7 TRISFbits.TRISF7

/* PORTF */
#define _RF0 PORTFbits.RF0
#define _RF1 PORTFbits.RF1
#define _RF3 PORTFbits.RF3
#define _RF4 PORTFbits.RF4
#define _RF5 PORTFbits.RF5
#define _RF7 PORTFbits.RF7

/* LATF */
#define _LATF0 LATFbits.LATF0
#define _LATF1 LATFbits.LATF1
#define _LATF3 LATFbits.LATF3
#define _LATF4 LATFbits.LATF4
#define _LATF5 LATFbits.LATF5
#define _LATF7 LATFbits.LATF7

/* ODCF */
#define _ODCF0 ODCFbits.ODCF0
#define _ODCF1 ODCFbits.ODCF1
#define _ODCF3 ODCFbits.ODCF3
#define _ODCF4 ODCFbits.ODCF4
#define _ODCF5 ODCFbits.ODCF5
#define _ODCF7 ODCFbits.ODCF7

