MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB606/mcu.h
#define _DMACH0_TRMODE0_POSITION                 0x00000002
#define _DMACH0_TRMODE0_MASK                     0x00000004
#define _DMACH0_TRMODE0_LENGTH                   0x00000001

#define _DMACH0_TRMODE1_POSITION                 0x00000003
#define _DMACH0_TRMODE1_MASK                     0x00000008
#define _DMACH0_TRMODE1_LENGTH                   0x00000001

#define _DMACH0_DAMODE0_POSITION                 0x00000004
#define _DMACH0_DAMODE0_MASK                     0x00000010
#define _DMACH0_DAMODE0_LENGTH                   0x00000001

#define _DMACH0_DAMODE1_POSITION                 0x00000005
#define _DMACH0_DAMODE1_MASK                     0x00000020
#define _DMACH0_DAMODE1_LENGTH                   0x00000001

#define _DMACH0_SAMODE0_POSITION                 0x00000006
#define _DMACH0_SAMODE0_MASK                     0x00000040
#define _DMACH0_SAMODE0_LENGTH                   0x00000001

#define _DMACH0_SAMODE1_POSITION                 0x00000007
#define _DMACH0_SAMODE1_MASK                     0x00000080
#define _DMACH0_SAMODE1_LENGTH                   0x00000001

#define _DMAINT0_HALFEN_POSITION                 0x00000000
#define _DMAINT0_HALFEN_MASK                     0x00000001
#define _DMAINT0_HALFEN_LENGTH                   0x00000001

#define _DMAINT0_OVRUNIF_POSITION                0x00000003
#define _DMAINT0_OVRUNIF_MASK                    0x00000008
#define _DMAINT0_OVRUNIF_LENGTH                  0x00000001

#define _DMAINT0_HALFIF_POSITION                 0x00000004
#define _DMAINT0_HALFIF_MASK                     0x00000010
#define _DMAINT0_HALFIF_LENGTH                   0x00000001

#define _DMAINT0_DONEIF_POSITION                 0x00000005
#define _DMAINT0_DONEIF_MASK                     0x00000020
#define _DMAINT0_DONEIF_LENGTH                   0x00000001

#define _DMAINT0_LOWIF_POSITION                  0x00000006
#define _DMAINT0_LOWIF_MASK                      0x00000040
#define _DMAINT0_LOWIF_LENGTH                    0x00000001

#define _DMAINT0_HIGHIF_POSITION                 0x00000007
#define _DMAINT0_HIGHIF_MASK                     0x00000080
#define _DMAINT0_HIGHIF_LENGTH                   0x00000001

#define _DMAINT0_CHSEL_POSITION                  0x00000008
#define _DMAINT0_CHSEL_MASK                      0x00007F00
#define _DMAINT0_CHSEL_LENGTH                    0x00000007

#define _DMAINT0_DBUFWF_POSITION                 0x0000000F
#define _DMAINT0_DBUFWF_MASK                     0x00008000
#define _DMAINT0_DBUFWF_LENGTH                   0x00000001

#define _DMAINT0_CHSEL0_POSITION                 0x00000008
#define _DMAINT0_CHSEL0_MASK                     0x00000100
#define _DMAINT0_CHSEL0_LENGTH                   0x00000001

#define _DMAINT0_CHSEL1_POSITION                 0x00000009
#define _DMAINT0_CHSEL1_MASK                     0x00000200
#define _DMAINT0_CHSEL1_LENGTH                   0x00000001

#define _DMAINT0_CHSEL2_POSITION                 0x0000000A
#define _DMAINT0_CHSEL2_MASK                     0x00000400
#define _DMAINT0_CHSEL2_LENGTH                   0x00000001

#define _DMAINT0_CHSEL3_POSITION                 0x0000000B
#define _DMAINT0_CHSEL3_MASK                     0x00000800
#define _DMAINT0_CHSEL3_LENGTH                   0x00000001

#define _DMAINT0_CHSEL4_POSITION                 0x0000000C
#define _DMAINT0_CHSEL4_MASK                     0x00001000
#define _DMAINT0_CHSEL4_LENGTH                   0x00000001

#define _DMAINT0_CHSEL5_POSITION                 0x0000000D
#define _DMAINT0_CHSEL5_MASK                     0x00002000
#define _DMAINT0_CHSEL5_LENGTH                   0x00000001

#define _DMAINT0_CHSEL6_POSITION                 0x0000000E
#define _DMAINT0_CHSEL6_MASK                     0x00004000
#define _DMAINT0_CHSEL6_LENGTH                   0x00000001

#define _DMACH1_CHEN_POSITION                    0x00000000
#define _DMACH1_CHEN_MASK                        0x00000001
#define _DMACH1_CHEN_LENGTH                      0x00000001

#define _DMACH1_SIZE_POSITION                    0x00000001
#define _DMACH1_SIZE_MASK                        0x00000002
#define _DMACH1_SIZE_LENGTH                      0x00000001

#define _DMACH1_TRMODE_POSITION                  0x00000002
#define _DMACH1_TRMODE_MASK                      0x0000000C
#define _DMACH1_TRMODE_LENGTH                    0x00000002

#define _DMACH1_DAMODE_POSITION                  0x00000004
#define _DMACH1_DAMODE_MASK                      0x00000030
#define _DMACH1_DAMODE_LENGTH                    0x00000002

#define _DMACH1_SAMODE_POSITION                  0x00000006
#define _DMACH1_SAMODE_MASK                      0x000000C0
#define _DMACH1_SAMODE_LENGTH                    0x00000002

#define _DMACH1_CHREQ_POSITION                   0x00000008
#define _DMACH1_CHREQ_MASK                       0x00000100
#define _DMACH1_CHREQ_LENGTH                     0x00000001

#define _DMACH1_RELOAD_POSITION                  0x00000009
#define _DMACH1_RELOAD_MASK                      0x00000200
#define _DMACH1_RELOAD_LENGTH                    0x00000001

#define _DMACH1_NULLW_POSITION                   0x0000000A
#define _DMACH1_NULLW_MASK                       0x00000400
#define _DMACH1_NULLW_LENGTH                     0x00000001

#define _DMACH1_TRMODE0_POSITION                 0x00000002
#define _DMACH1_TRMODE0_MASK                     0x00000004
#define _DMACH1_TRMODE0_LENGTH                   0x00000001

#define _DMACH1_TRMODE1_POSITION                 0x00000003
#define _DMACH1_TRMODE1_MASK                     0x00000008
#define _DMACH1_TRMODE1_LENGTH                   0x00000001

#define _DMACH1_DAMODE0_POSITION                 0x00000004
#define _DMACH1_DAMODE0_MASK                     0x00000010
#define _DMACH1_DAMODE0_LENGTH                   0x00000001

#define _DMACH1_DAMODE1_POSITION                 0x00000005
#define _DMACH1_DAMODE1_MASK                     0x00000020
#define _DMACH1_DAMODE1_LENGTH                   0x00000001

#define _DMACH1_SAMODE0_POSITION                 0x00000006
#define _DMACH1_SAMODE0_MASK                     0x00000040
#define _DMACH1_SAMODE0_LENGTH                   0x00000001

#define _DMACH1_SAMODE1_POSITION                 0x00000007
#define _DMACH1_SAMODE1_MASK                     0x00000080
#define _DMACH1_SAMODE1_LENGTH                   0x00000001

#define _DMAINT1_HALFEN_POSITION                 0x00000000
#define _DMAINT1_HALFEN_MASK                     0x00000001
#define _DMAINT1_HALFEN_LENGTH                   0x00000001

